"""
运算符
"""
# 算数运算符
print(321 + 12) # 加法
print(321 - 12) # 减法
print(321 * 12) # 乘法
print(321 / 12) # 除法
print(321 //12) # 整除
print(321 % 12) # 取余
print(321 ** 12) # 求幂

# 赋值运算符
a = 10
b = 3
a += b # a = a + b
a *= a + 2 # a = a * (a + 2)

# 比较运算符和逻辑运算符
flag0 = 1 == 1
flag1 = 3 < 2
flag2 = 2 != 2
flag3 = flag0 and flag1 # 短路与
flag4 = flag0 or flag1 # 短路或
flag5 = not flag2 # 非

"""
将华氏温度转为摄氏温度
"""
f = float(input('请输入华氏温度：'))
c = (f - 32) / 1.8
print('%.1f华氏度 = %.1f摄氏度' % (f, c)) # `%d`->`int`; `%s`->`str`

"""
字符串前面的`f`表示这个字符串是需要格式化处理的
其中的`{f:.1f}`和`{c:.1f}`可以先看成是`{f}`和`{c}`，表示输出时会用变量`f`和变量`c`的值替换掉这两个占位符
后面的`:.1f`表示这是一个浮点数，小数点后保留1位有效数字
"""
print(f'{f:.1f}华氏度 = {c:.1f}摄氏度')